export const metaDataMainPage = {
    title: "Шикарный вид",
    description: "Отель Шикарный вид в Кабардинке, предназначен для шикарного отдыха и приятных воспоминаний. Краснодарский край, Кабардинка, ул. Сухумское Шоссе , 1а,  +7-989-2430-60-80 для бронирования и обслуживания гостей.",
    keywords: [
        "Шикарный Вид",
        "Кабардинка",
        "Краснодарский край",
        "Черное море",
        "отель",
        "пляж",
        "жилье на море",
        "семейный отдых",
        "летний отдых",
        "комфортый отдых",
        "южное побережье России",
    ], // Ключевые слова, связанные с вашим отелем и местоположением
    openGraph: {
        title: 'Шикарный вид',
        description: 'Отель Шикарный вид в Кабардинке, предназначен для шикарного отдыха и приятных воспоминаний. Краснодарский край, Кабардинка, ул. Сухумское Шоссе , 1а,  +7-989-2430-60-80 для бронирования и обслуживания гостей.',
        url: 'https://shikarnyivid.ru', // Абсолютный URL вашей страницы
        images: [   //изображений, которые могут быть использованы для представления вашей страницы при ее публикации в социальных сетях или других сервисах
            {
                url: 'https://shikarnyivid.ru/previeImg.jpg', // Абсолютный URL изображения
                width: 1200,
                height: 630,
                alt: 'Отель "Шикарный Вид" в Кабардинке', // Альтернативный текст для изображения
            },
        ],
        locale: 'ru_RU', // Языковая локаль (русский, Россия)
        type: 'website', // Тип страницы (веб-сайт)
    },
    robots: {
        index: true, // Не индексировать страницу
        follow: true, // Следовать по ссылкам на странице
        googleBot: {
            index: true, // Индексировать содержимое страницы GoogleBot
            follow: true, // Не следовать по ссылкам GoogleBot
        },
        yandexBot: {
            index: true, // Индексировать содержимое страницы YandexBot
            follow: true, // Следовать по ссылкам YandexBot
        },
    },
};

export const mataDataHotelsPage = {
    title: "Все наши отели || Шикарный вид",
    description: "Выбирайте любой наш отель на Черном море в Кабардинке, Геленджике, Сочи. Забронируйте прямо сейчас! Телефон: +7-989-2430-60-80.",
    keywords: [
        "Шикарный Вид",
        "Кабардинка",
        "Геленджик",
        "Сочи",
        "Краснодарский край",
        "отель",
        "гостиница",
        "гостиницы сочи",
        "отели на черном море",
        "жилье на море",
        "жилье на черном море",
        "отдых на черном море",
        "кабардинка отдых",
        "геленджик отели",
        "южное побережье России",
    ], // Ключевые слова, связанные с вашим отелем и местоположением

    openGraph: {
        title: 'Все наши отели || Шикарный вид',
        description: 'Выбирайте любой наш отель на Черном море в Кабардинке, Геленджике, Сочи. Забронируйте прямо сейчас! Телефон: +7-989-2430-60-80.',
        url: 'https://shikarnyivid.ru/hotels', // Абсолютный URL вашей страницы
        images: [   //изображений, которые могут быть использованы для представления вашей страницы при ее публикации в социальных сетях или других сервисах
            {
                url: 'https://shikarnyivid.ru/previeImg.jpg', // Абсолютный URL изображения
                width: 1200,
                height: 630,
                alt: 'Отель "Шикарный Вид" в Кабардинке', // Альтернативный текст для изображения
            },
        ],
        locale: 'ru_RU', // Языковая локаль (русский, Россия)
        type: 'website', // Тип страницы (веб-сайт)
    },
    robots: {
        index: true, // Не индексировать страницу
        follow: true, // Следовать по ссылкам на странице
        googleBot: {
            index: true, // Индексировать содержимое страницы GoogleBot
            follow: true, // Не следовать по ссылкам GoogleBot
        },
        yandexBot: {
            index: true, // Индексировать содержимое страницы YandexBot
            follow: true, // Следовать по ссылкам YandexBot
        },
    },
};

export const metaDataContactsPage = {
    title: "Контакты || Шикарный вид",
    description: "Контакты отеля Шикарный вид в Кабардинке. Краснодарский край, Кабардинка, ул. Сухумское Шоссе , 1а,  +7-989-2430-60-80 для бронирования и обслуживания гостей.",
    keywords: [
        "Шикарный Вид",
        "Кабардинка",
        "Краснодарский край",
        "Черное море",
        "отель",
        "пляж",
        "жилье на море",
        "семейный отдых",
        "летний отдых",
        "комфортый отдых",
        "южное побережье России",
        "контакты",
        "номер телефона",
    ], // Ключевые слова, связанные с вашим отелем и местоположением

    openGraph: {
        title: 'Контакты || Шикарный вид',
        description: 'Контакты отеля Шикарный вид в Кабардинке. Краснодарский край, Кабардинка, ул. Сухумское Шоссе , 1а,  +7-989-2430-60-80 для бронирования и обслуживания гостей.',
        url: 'https://shikarnyivid.ru/contacts', // Абсолютный URL вашей страницы
        images: [   //изображений, которые могут быть использованы для представления вашей страницы при ее публикации в социальных сетях или других сервисах
            {
                url: 'https://shikarnyivid.ru/previeImg.jpg', // Абсолютный URL изображения
                width: 1200,
                height: 630,
                alt: 'Отель "Шикарный Вид" в Кабардинке', // Альтернативный текст для изображения
            },
        ],
        locale: 'ru_RU', // Языковая локаль (русский, Россия)
        type: 'website', // Тип страницы (веб-сайт)
    },
    robots: {
        index: true, // Не индексировать страницу
        follow: true, // Следовать по ссылкам на странице
        googleBot: {
            index: true, // Индексировать содержимое страницы GoogleBot
            follow: true, // Не следовать по ссылкам GoogleBot
        },
        yandexBot: {
            index: true, // Индексировать содержимое страницы YandexBot
            follow: true, // Следовать по ссылкам YandexBot
        },
    },
};

export const metaDataQuestionPage = {
    title: "Вопросы - ответы || Шикарный вид",
    description: "Вопросы - ответы отеля Шикарный вид в Кабардинке. Тут вы узнаете ответы на все часто заадаваемые вопросы.",
    keywords: [
        "Шикарный Вид",
        "Кабардинка",
        "Краснодарский край",
        "Черное море",
        "информация об отеле",
        "информация о пляже",
        "жилье на море",
        "семейный отдых",
        "летний отдых",
        "комфортый отдых",
        "южное побережье России",
        "контакты",
        "номер телефона",
        "вопрос-ответ"
    ], // Ключевые слова, связанные с вашим отелем и местоположением

    openGraph: {
        title: 'Вопрос-ответ || Шикарный вид',
        description: 'Вопросы - ответы отеля Шикарный вид в Кабардинке. Тут вы узнаете ответы на все часто заадаваемые вопросы.',
        url: 'https://shikarnyivid.ru/questionlist', // Абсолютный URL вашей страницы
        images: [   //изображений, которые могут быть использованы для представления вашей страницы при ее публикации в социальных сетях или других сервисах
            {
                url: 'https://shikarnyivid.ru/previeImg.jpg', // Абсолютный URL изображения
                width: 1200,
                height: 630,
                alt: 'Отель "Шикарный Вид" в Кабардинке', // Альтернативный текст для изображения
            },
        ],
        locale: 'ru_RU', // Языковая локаль (русский, Россия)
        type: 'website', // Тип страницы (веб-сайт)
    },
    robots: {
        index: true, // Не индексировать страницу
        follow: true, // Следовать по ссылкам на странице
        googleBot: {
            index: true, // Индексировать содержимое страницы GoogleBot
            follow: true, // Не следовать по ссылкам GoogleBot
        },
        yandexBot: {
            index: true, // Индексировать содержимое страницы YandexBot
            follow: true, // Следовать по ссылкам YandexBot
        },
    },
};

export const metaDataReservationAllPage = {
    title: "Бронирование || Шикарный вид",
    description: "Выбирайте и бронируйте номера на Черном море в наших отелях в Кабардинке, Сочи, Геленджике. Сравните цены, количество комнат и вместимость для идеального отдыха у моря.",
    keywords: [
        "Шикарный Вид",
        "Кабардинка",
        "Геленджик",
        "Сочи",
        "Краснодарский край",
        "бронирование отеля",
        "забронировать номер",
        "кабардинка номера",
        "Сочи номера",
        "Геленджик номера",
        "кабардинка отели",
        "Сочи отели",
        "Геленджик отели",
        "кабардинка отдых",
        "Сочи отдых",
        "Геленджик отдых",
        "отель кабардинка",
        "жилье в кабардинке",
        "кабардинка жилье недорого",
        "кабардинка гостевые дома",
        "гостевые дома кабардинки цены",
        "кабардинка снять жилье +у моря",
    ], // Ключевые слова, связанные с вашим отелем и местоположением

    openGraph: {
        title: 'Бронирование || Шикарный вид',
        description: "Выбирайте и бронируйте номера на Черном море в наших отелях в Кабардинке, Сочи, Геленджике. Сравните цены, количество комнат и вместимость для идеального отдыха у моря.",
        url: 'https://shikarnyivid.ru/reservationall', // Абсолютный URL вашей страницы
        images: [   //изображений, которые могут быть использованы для представления вашей страницы при ее публикации в социальных сетях или других сервисах
            {
                url: 'https://shikarnyivid.ru/previeImg.jpg', // Абсолютный URL изображения
                width: 1200,
                height: 630,
                alt: 'Отель "Шикарный Вид" в Кабардинке', // Альтернативный текст для изображения
            },
        ],
        locale: 'ru_RU', // Языковая локаль (русский, Россия)
        type: 'website', // Тип страницы (веб-сайт)
    },
    robots: {
        index: true, // Не индексировать страницу
        follow: true, // Следовать по ссылкам на странице
        googleBot: {
            index: true, // Индексировать содержимое страницы GoogleBot
            follow: true, // Не следовать по ссылкам GoogleBot
        },
        yandexBot: {
            index: true, // Индексировать содержимое страницы YandexBot
            follow: true, // Следовать по ссылкам YandexBot
        },
    },
};

export const metaDataCurrentRoom = (id, getData) => {
    return {
        title: `${getData.currentApartments.nameApartment} || ${getData.currentHotel.nameHotel}`,
        description: `${getData.currentApartments.roomsDescription}`,
        keywords: [
            "Шикарный Вид",
            "Кабардинка",
            "Краснодарский край",
            "бронирование отеля",
            "забронировать номер",
            "кабардинка номера",
            "кабардинка отели",
            "отель кабардинка",
            "кабардинка отдых",
            "кабардинка номера",
            "жилье в кабардинке",
            "кабардинка жилье недорого",
            "кабардинка гостевые дома",
            "гостевые дома кабардинки цены",
            "кабардинка снять жилье +у моря",
            "отель номер удобства",
            "удобства +в номере",
        ], // Ключевые слова, связанные с вашим отелем и местоположением
        openGraph: {
            title: `${getData.currentApartments.nameApartment} || ${getData.currentHotel.nameHotel}`,
            description: `${getData.currentApartments.roomsDescription}`,
            url: `https://shikarnyivid.ru/${id}`, // Абсолютный URL вашей страницы
            images: [   //изображений, которые могут быть использованы для представления вашей страницы при ее публикации в социальных сетях или других сервисах
                {
                    url: 'https://shikarnyivid.ru/previeImg.jpg', // Абсолютный URL изображения
                    width: 1200,
                    height: 630,
                    alt: 'Отель "Шикарный Вид" в Кабардинке', // Альтернативный текст для изображения
                },
            ],
            locale: 'ru_RU', // Языковая локаль (русский, Россия)
            type: 'website', // Тип страницы (веб-сайт)
        },
        robots: {
            index: true, // Не индексировать страницу
            follow: true, // Следовать по ссылкам на странице
            googleBot: {
                index: true, // Индексировать содержимое страницы GoogleBot
                follow: true, // Не следовать по ссылкам GoogleBot
            },
            yandexBot: {
                index: true, // Индексировать содержимое страницы YandexBot
                follow: true, // Следовать по ссылкам YandexBot
            },
        },
    }
};

